IRP/src/AccumulationRegisters/R6020B_BatchBalance/R6020B_BatchBalance.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R6020B_BatchBalance</name>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <resources>
  <name>InvoiceAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>InvoiceTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>IndirectCostAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>IndirectCostTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>ExtraCostAmountByRatio</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>ExtraCostTaxAmountByRatio</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>ExtraDirectCostAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>ExtraDirectCostTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AllocatedCostAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AllocatedCostTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AllocatedRevenueAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AllocatedRevenueTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>TotalAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>TotalNetAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>TotalTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>CalculationMovementCost</name>
  <type>
   <types>DocumentRef.CalculationMovementCosts</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Store</name>
  <type>
   <types>CatalogRef.Stores</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Batch</name>
  <type>
   <types>EnumRef.BatchType</types>
   <types>CatalogRef.Batches</types>
  </type>
 </dimensions>
 <dimensions>
  <name>BatchKey</name>
  <type>
   <types>CatalogRef.BatchKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>InventoryOrigin</name>
  <type>
   <types>EnumRef.InventoryOriginTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>SourceOfOrigin</name>
  <type>
   <types>CatalogRef.SourceOfOrigins</types>
  </type>
 </dimensions>
 <dimensions>
  <name>SerialLotNumber</name>
  <type>
   <types>CatalogRef.SerialLotNumbers</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Partner</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Agreement</name>
  <type>
   <types>CatalogRef.Agreements</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LegalName</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/AccumulationRegisters/R6020B_BatchBalance/RecordSetModule.bsl
Procedure BeforeWrite(Cancel, Replacing)
	If DataExchange.Load Then
		Return;
	EndIf;
	
	For Each _row In ThisObject Do
		_row.TotalNetAmount = 
			  _row.InvoiceAmount 
			  + _row.IndirectCostAmount
			  + _row.ExtraCostAmountByRatio
			  + _row.ExtraDirectCostAmount
			  + _row.AllocatedCostAmount
			  - _row.AllocatedRevenueAmount
			  + _row.PreliminaryAmount;
			  
		_row.TotalTaxAmount = 
			  _row.InvoiceTaxAmount 
			  + _row.IndirectCostTaxAmount
			  + _row.ExtraCostTaxAmountByRatio
			  + _row.ExtraDirectCostTaxAmount
			  + _row.AllocatedCostTaxAmount
			  - _row.AllocatedRevenueTaxAmount
			  + _row.PreliminaryTaxAmount;                      
			  
		_row.TotalAmount = _row.TotalNetAmount + _row.TotalTaxAmount;	  
	EndDo;
EndProcedure
